# RuleValue Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterIntegerRule..::..RuleValue Property
FilterIntegerRule Class See Also
---
The user-supplied value against which values from a Revit document will be tested.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public int RuleValue { get; set; }
```

Visual Basic
---
```text
Public Property RuleValue As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int RuleValue {
	int get ();
	void set (int value);
}
```

# See Also
FilterIntegerRule Class
Autodesk.Revit.DB Namespace